function [dy,dx] = diff_ctr(y,Dt,n)
%中心差分算法实现数值微分
%  调用格式：
%    [d_y, d_x] = diff_ctr(y,Dt,n)
%  其中，y为给定的等间距的实测数据构成的向量， Dt为自变量的间距，n为所需的导数阶次。 
%  向量d_y为得出的导数向量， 而d_x为相应的自变量向量。注意这两个向量的长度比y短。
y1=[y 0 0 0 0 0 0];
y2=[0 y 0 0 0 0 0];
y3=[0 0 y 0 0 0 0];
y4=[0 0 0 y 0 0 0];
y5=[0 0 0 0 y 0 0];
y6=[0 0 0 0 0 y 0];
y7=[0 0 0 0 0 0 y];
switch n
    case 1
        dy = (-y1+8*y2-8*y4+y5)/12/Dt;
    case 2
        dy = (-y1+16*y2-30*y3+16*y4-y5)/12/Dt^2;
    case 3
        dy = (-y1+8*y2-13*y3+13*y5-8*y6+y7)/8/Dt^3;
    case 4
        dy = (-y1+12*y2-39*y3+56*y4-39*y5+12*y6-y7)/6/Dt^4;
end
dy = dy(5+2*(n>2):end-4-2*(n>2));
dx = ([2:length(dy)+1]+(n>2))*Dt;